rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC_GAMEPAD/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
/**
 ******************************************************************************
 * @file    usbh_core.c
 * @author  MCD Application Team
 * @brief   This file implements the functions for the core state machine process
 *          the enumeration and the control transfer process
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                      www.st.com/SLA0044
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "usbh_core.h"
#include "usb_host.h"
/** @addtogroup USBH_LIB
 * @{
 */

/** @addtogroup USBH_LIB_CORE
 * @{
 */

/** @defgroup USBH_CORE
 * @brief This file handles the basic enumeration when a device is connected
 *          to the host.
 * @{
 */

/** @defgroup USBH_CORE_Private_Defines
 * @{
 */
#define USBH_ADDRESS_DEFAULT                     0x00U
#define USBH_ADDRESS_ASSIGNED                    0x01U
#define USBH_MPS_DEFAULT                         0x40U
/**
 * @}
 */

/** @defgroup USBH_CORE_Private_Macros
 * @{
 */
/**
 * @}
 */

/** @defgroup USBH_CORE_Private_Variables
 * @{
 */
#if (USBH_USE_OS == 1U)
#if (osCMSIS >= 0x20000U)
osThreadAttr_t USBH_Thread_Atrr;
#endif
#endif

/**
 * @}
 */

/** @defgroup USBH_CORE_Private_Functions
 * @{
 */
static USBH_StatusTypeDef USBH_HandleEnum(USBH_HandleTypeDef *phost);
static void USBH_HandleSof(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef DeInitStateMachine(USBH_HandleTypeDef *phost);

extern void MX_USB_HOST_Init_FS(void);

#if (USBH_USE_OS == 1U)
#if (osCMSIS < 0x20000U)
static void USBH_Process_OS(void const *argument);
#else
static void USBH_Process_OS(void *argument);
#endif
#endif

/**
 * @brief  HCD_Init
 *         Initialize the HOST Core.
 * @param  phost: Host Handle
 * @param  pUsrFunc: User Callback
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_Init(USBH_HandleTypeDef *phost,
		void (*pUsrFunc)(USBH_HandleTypeDef *phost, uint8_t id), uint8_t id) {
	/* Check whether the USB Host handle is valid */
	if (phost == NULL) {
		USBH_ErrLog("Invalid Host handle");
		return USBH_FAIL;
	}

	/* Set DRiver ID */
	phost->id = id;

	/* Unlink class*/
	phost->pActiveClass = NULL;
	phost->ClassNumber = 0U;

	/* Restore default states and prepare EP0 */
	(void) DeInitStateMachine(phost);

	/* Restore default Device connection states */
	phost->device.PortEnabled = 0U;
	phost->device.is_connected = 0U;
	phost->device.is_disconnected = 0U;
	phost->device.is_ReEnumerated = 0U;

	/* Assign User process */
	if (pUsrFunc != NULL) {
		phost->pUser = pUsrFunc;
	}

#if (USBH_USE_OS == 1U)
#if (osCMSIS < 0x20000U)

  /* Create USB Host Queue */
  osMessageQDef(USBH_Queue, MSGQUEUE_OBJECTS, uint16_t);
  phost->os_event = osMessageCreate(osMessageQ(USBH_Queue), NULL);

  /* Create USB Host Task */
#if defined (USBH_PROCESS_STACK_SIZE)
  osThreadDef(USBH_Thread, USBH_Process_OS, USBH_PROCESS_PRIO, 0U, USBH_PROCESS_STACK_SIZE);
#else
  osThreadDef(USBH_Thread, USBH_Process_OS, USBH_PROCESS_PRIO, 0U, 8U * configMINIMAL_STACK_SIZE);
#endif /* defined (USBH_PROCESS_STACK_SIZE) */

  phost->thread = osThreadCreate(osThread(USBH_Thread), phost);

#else

  /* Create USB Host Queue */
  phost->os_event = osMessageQueueNew(MSGQUEUE_OBJECTS, sizeof(uint32_t), NULL);

  /* Create USB Host Task */
  USBH_Thread_Atrr.name = "USBH_Queue";

#if defined (USBH_PROCESS_STACK_SIZE)
  USBH_Thread_Atrr.stack_size = USBH_PROCESS_STACK_SIZE;
#else
  USBH_Thread_Atrr.stack_size = (8U * configMINIMAL_STACK_SIZE);
#endif /* defined (USBH_PROCESS_STACK_SIZE) */

  USBH_Thread_Atrr.priority = USBH_PROCESS_PRIO;
  phost->thread = osThreadNew(USBH_Process_OS, phost, &USBH_Thread_Atrr);

#endif /* (osCMSIS < 0x20000U) */
#endif /* (USBH_USE_OS == 1U) */

	/* Initialize low level driver */
	(void) USBH_LL_Init(phost);

	return USBH_OK;
}

/**
 * @brief  HCD_DeInit
 *         De-Initialize the Host portion of the driver.
 * @param  phost: Host Handle
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_DeInit(USBH_HandleTypeDef *phost) {
	(void) DeInitStateMachine(phost);

	/* Restore default Device connection states */
	phost->device.PortEnabled = 0U;
	phost->device.is_connected = 0U;
	phost->device.is_disconnected = 0U;
	phost->device.is_ReEnumerated = 0U;
	phost->device.RstCnt = 0U;
	phost->device.EnumCnt = 0U;

	if (phost->pData != NULL) {
		(void) USBH_LL_Stop(phost);

		(void) USBH_LL_DeInit(phost);
	}

#if (USBH_USE_OS == 1U)
#if (osCMSIS < 0x20000U)

  /* Free allocated resource for USBH process */
  (void)osThreadTerminate(phost->thread);
  (void)osMessageDelete(phost->os_event);

#else

  /* Free allocated resource for USBH process */
  (void)osThreadTerminate(phost->thread);
  (void)osMessageQueueDelete(phost->os_event);

#endif /* (osCMSIS < 0x20000U) */
#endif /* (USBH_USE_OS == 1U) */

#ifdef HOST_HS
	if (phost->id == HOST_HS) {
		// stm32f4xx_hal_rcc_ex.h
		__HAL_RCC_USB_OTG_HS_FORCE_RESET();
		__HAL_RCC_USB_OTG_HS_RELEASE_RESET();
	}
#endif

#ifdef HOST_FS
	if (phost->id == HOST_FS) {
		// stm32f4xx_hal_rcc_ex.h
		__HAL_RCC_USB_OTG_FS_FORCE_RESET();
		__HAL_RCC_USB_OTG_FS_RELEASE_RESET();
	}
#endif

	return USBH_OK;
}

/**
 * @brief  DeInitStateMachine
 *         De-Initialize the Host state machine.
 * @param  phost: Host Handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef DeInitStateMachine(USBH_HandleTypeDef *phost) {
	uint32_t i = 0U;

	/* Clear Pipes flags*/
	for (i = 0U; i < USBH_MAX_PIPES_NBR; i++) {
		phost->Pipes[i] = 0U;
	}

	for (i = 0U; i < USBH_MAX_DATA_BUFFER; i++) {
		phost->device.Data[i] = 0U;
	}

	phost->gState = HOST_IDLE;
	phost->EnumState = ENUM_IDLE;
	phost->RequestState = CMD_SEND;
	phost->Timer = 0U;

