rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC_GAMEPAD/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
	phost->Control.state = CTRL_SETUP;
	phost->Control.pipe_size = USBH_MPS_DEFAULT;
	phost->Control.errorcount = 0U;

	phost->device.address = USBH_ADDRESS_DEFAULT;
	phost->device.speed = (uint8_t) USBH_SPEED_FULL;
	phost->device.RstCnt = 0U;
	phost->device.EnumCnt = 0U;

	return USBH_OK;
}

/**
 * @brief  USBH_RegisterClass
 *         Link class driver to Host Core.
 * @param  phost : Host Handle
 * @param  pclass: Class handle
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_RegisterClass(USBH_HandleTypeDef *phost,
		USBH_ClassTypeDef *pclass) {
	USBH_StatusTypeDef status = USBH_OK;

	if (pclass != NULL) {
		if (phost->ClassNumber < USBH_MAX_NUM_SUPPORTED_CLASS) {
			/* link the class to the USB Host handle */
			phost->pClass[phost->ClassNumber++] = pclass;
			status = USBH_OK;
		} else {
			USBH_ErrLog("Max Class Number reached");
			status = USBH_FAIL;
		}
	} else {
		USBH_ErrLog("Invalid Class handle");
		status = USBH_FAIL;
	}

	return status;
}

/**
 * @brief  USBH_SelectInterface
 *         Select current interface.
 * @param  phost: Host Handle
 * @param  interface: Interface number
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_SelectInterface(USBH_HandleTypeDef *phost,
		uint8_t interface) {
	USBH_StatusTypeDef status = USBH_OK;

	USBH_UsrLog("Switching to Interface (#%d)", interface);

	if (interface < phost->device.CfgDesc.bNumInterfaces) {
		phost->device.current_interface = interface;
//    USBH_UsrLog("Switching to Interface (#%d)", interface);
//    USBH_UsrLog("Class    : %xh", phost->device.CfgDesc.Itf_Desc[interface].bInterfaceClass);
//    USBH_UsrLog("SubClass : %xh", phost->device.CfgDesc.Itf_Desc[interface].bInterfaceSubClass);
//    USBH_UsrLog("Protocol : %xh", phost->device.CfgDesc.Itf_Desc[interface].bInterfaceProtocol);
	} else {
		USBH_ErrLog("Cannot Select This Interface.");
		status = USBH_FAIL;
	}

	return status;
}

/**
 * @brief  USBH_GetActiveClass
 *         Return Device Class.
 * @param  phost: Host Handle
 * @param  interface: Interface index
 * @retval Class Code
 */
uint8_t USBH_GetActiveClass(USBH_HandleTypeDef *phost) {
	return (phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass);
}

/**
 * @brief  USBH_FindInterface
 *         Find the interface index for a specific class.
 * @param  phost: Host Handle
 * @param  Class: Class code
 * @param  SubClass: SubClass code
 * @param  Protocol: Protocol code
 * @retval interface index in the configuration structure
 * @note : (1)interface index 0xFF means interface index not found
 */
uint8_t USBH_FindInterface(USBH_HandleTypeDef *phost, uint8_t Class,
		uint8_t SubClass, uint8_t Protocol) {
	USBH_InterfaceDescTypeDef *pif;
	USBH_CfgDescTypeDef *pcfg;
	uint8_t if_ix = 0U;

	pif = (USBH_InterfaceDescTypeDef*) NULL;
	pcfg = &phost->device.CfgDesc;

	while (if_ix < USBH_MAX_NUM_INTERFACES) {
		pif = &pcfg->Itf_Desc[if_ix];
		if (((pif->bInterfaceClass == Class) || (Class == 0xFFU))
				&& ((pif->bInterfaceSubClass == SubClass) || (SubClass == 0xFFU))
				&& ((pif->bInterfaceProtocol == Protocol) || (Protocol == 0xFFU))) {
			return if_ix;
		}
		if_ix++;
	}
	return 0xFFU;
}

uint8_t USBH_CheckInterface(USBH_HandleTypeDef *phost, uint8_t interface_number,
		uint8_t Class, uint8_t SubClass, uint8_t Protocol) {
	USBH_InterfaceDescTypeDef *pif;
	USBH_CfgDescTypeDef *pcfg;
	uint8_t if_ix = interface_number;

	pif = (USBH_InterfaceDescTypeDef*) NULL;
	pcfg = &phost->device.CfgDesc;

	//while (if_ix < USBH_MAX_NUM_INTERFACES) {
	pif = &pcfg->Itf_Desc[if_ix];
	if (((pif->bInterfaceClass == Class) || (Class == 0xFFU))
			&& ((pif->bInterfaceSubClass == SubClass) || (SubClass == 0xFFU))
			&& ((pif->bInterfaceProtocol == Protocol) || (Protocol == 0xFFU))) {
		return if_ix;
	}
	//if_ix++;
	//}
	return 0xFFU;
}

/**
 * @brief  USBH_FindInterfaceIndex
 *         Find the interface index for a specific class interface and alternate setting number.
 * @param  phost: Host Handle
 * @param  interface_number: interface number
 * @param  alt_settings    : alternate setting number
 * @retval interface index in the configuration structure
 * @note : (1)interface index 0xFF means interface index not found
 */
uint8_t USBH_FindInterfaceIndex(USBH_HandleTypeDef *phost,
		uint8_t interface_number, uint8_t alt_settings) {
	USBH_InterfaceDescTypeDef *pif;
	USBH_CfgDescTypeDef *pcfg;
	uint8_t if_ix = 0U;

	pif = (USBH_InterfaceDescTypeDef*) NULL;
	pcfg = &phost->device.CfgDesc;

	while (if_ix < USBH_MAX_NUM_INTERFACES) {
		pif = &pcfg->Itf_Desc[if_ix];
		if ((pif->bInterfaceNumber == interface_number)
				&& (pif->bAlternateSetting == alt_settings)) {
			return if_ix;
		}
		if_ix++;
	}
	return 0xFFU;
}

/**
 * @brief  USBH_Start
 *         Start the USB Host Core.
 * @param  phost: Host Handle
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_Start(USBH_HandleTypeDef *phost) {
	/* Start the low level driver  */
	(void) USBH_LL_Start(phost);

	/* Activate VBUS on the port */
	(void) USBH_LL_DriverVBUS(phost, TRUE);

	return USBH_OK;
}

/**
 * @brief  USBH_Stop
 *         Stop the USB Host Core.
 * @param  phost: Host Handle
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_Stop(USBH_HandleTypeDef *phost) {
	/* DeActivate VBUS on the port */
	(void) USBH_LL_DriverVBUS(phost, FALSE);

	/* Stop and cleanup the low level driver  */
	(void) USBH_LL_Stop(phost);

	/* Free Control Pipes */
	(void) USBH_FreePipe(phost, phost->Control.pipe_in);
	(void) USBH_FreePipe(phost, phost->Control.pipe_out);

	return USBH_OK;
}

/**
 * @brief  HCD_ReEnumerate
 *         Perform a new Enumeration phase.
 * @param  phost: Host Handle
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_ReEnumerate(USBH_HandleTypeDef *phost) {
	if (USBH_IsPortEnabled(phost) != 0U) {
		phost->device.is_ReEnumerated = 1U;

		/* Stop Host */
		(void) USBH_Stop(phost);

		phost->device.is_disconnected = 1U;
	}

#if (USBH_USE_OS == 1U)
  phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

	return USBH_OK;
}

/**
 * @brief  USBH_Process
 *         Background process of the USB Core.
 * @param  phost: Host Handle
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_Process(USBH_HandleTypeDef *phost) {
	__IO USBH_StatusTypeDef status = USBH_FAIL;
	uint8_t idx = 0U;

	/* check for Host pending port disconnect event */
	if (phost->device.is_disconnected == 1U) {
		phost->gState = HOST_DEV_DISCONNECTED;
	}

