rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC_GAMEPAD/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
	switch (phost->gState) {

	case HOST_IDLE:
		if ((phost->device.is_connected) != 0U) {
			if (phost->resetPortPhase == 0U) {
				USBH_UsrLog("\nUSB Device Connected");

				phost->resetPortTimer = USBH_GetTick();

				phost->resetPortPhase = 1U;
			} else if (phost->resetPortPhase == 1U) {
				/* Wait for 275 ms after connection */
				/* https://www.usbmadesimple.co.uk/ums_5.htm */
				if ((USBH_GetTick() - phost->resetPortTimer) > 275U) {
					phost->resetPortPhase = 2U;
				}
			} else if (phost->resetPortPhase == 2U) {
				/* RESET 31 ms */
				(void) USBH_LL_ResetPort_Start(phost);

				phost->resetPortTimer = USBH_GetTick();

				phost->resetPortPhase = 3U;
			} else if (phost->resetPortPhase == 3U) {
				/* RESET 15 ms */
				if ((USBH_GetTick() - phost->resetPortTimer) > 15U) {
					(void) USBH_LL_ResetPort_End(phost);

					phost->resetPortTimer = USBH_GetTick();

					phost->resetPortPhase = 4U;
				}
			} else if (phost->resetPortPhase == 4U) {
				if ((USBH_GetTick() - phost->resetPortTimer) > 10U) {
					phost->resetPortPhase = 5U;
				}
			} else if (phost->resetPortPhase == 5U) {
				phost->resetPortPhase = 0U;

				phost->gState = HOST_DEV_WAIT_FOR_ATTACHMENT;
				/* Make sure to start with Default address */
				phost->device.address = USBH_ADDRESS_DEFAULT;
				phost->Timeout = USBH_GetTick(); //0U;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			}
		} else {
			phost->resetPortPhase = 0U;
		}
		break;

	case HOST_DEV_WAIT_FOR_ATTACHMENT: /* Wait for Port Enabled */
		if (phost->device.PortEnabled == 1U) {
			USBH_UsrLog("USB Device Reset Completed");
			phost->device.RstCnt = 0U;
			phost->gState = HOST_DEV_ATTACHED;
			phost->resetPortPhase = 0U;
		} else {
			if ((USBH_GetTick() - phost->Timeout) > USBH_DEV_RESET_TIMEOUT) {
				phost->device.RstCnt++;
				if (phost->device.RstCnt > 3U) {
					/* Buggy Device can't complete reset */
					//USBH_UsrLog("USB Reset Failed, Please unplug the Device.");
					phost->gState = HOST_ABORT_STATE;
					phost->Timeout = USBH_GetTick(); //0U;
				} else {
					phost->gState = HOST_IDLE;
				}
				//} else {
				//phost->Timeout += 10U;
				//USBH_Delay(10U);
			}
		}
#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HOST_DEV_ATTACHED:

		if (phost->pUser != NULL) {
			phost->pUser(phost, HOST_USER_CONNECTION);
		}

		if (phost->resetPortPhase == 0U) {
			phost->resetPortTimer = USBH_GetTick();

			phost->resetPortPhase = 1U;
		} else if (phost->resetPortPhase == 1U) {
			/* Wait for 100 ms after Reset */
			if ((USBH_GetTick() - phost->resetPortTimer) > 100U) {
				phost->resetPortPhase = 2U;
			}
		} else if (phost->resetPortPhase == 2U) {
			phost->resetPortPhase = 0U;

			phost->device.speed = (uint8_t) USBH_LL_GetSpeed(phost);

			phost->gState = HOST_ENUMERATION;
			phost->Timeout = USBH_GetTick(); //0U;

			phost->Control.pipe_out = USBH_AllocPipe(phost, 0x00U);
			phost->Control.pipe_in = USBH_AllocPipe(phost, 0x80U);

			/* Open Control pipes */
			(void) USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U,
					phost->device.address, phost->device.speed,
					USBH_EP_CONTROL, (uint16_t) phost->Control.pipe_size);

			/* Open Control pipes */
			(void) USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U,
					phost->device.address, phost->device.speed,
					USBH_EP_CONTROL, (uint16_t) phost->Control.pipe_size);

#if (USBH_USE_OS == 1U)
	      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
	#if (osCMSIS < 0x20000U)
	      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
	#else
	      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
	#endif
	#endif
		}

		break;

	case HOST_ENUMERATION:
		/* Check for enumeration status */
		status = USBH_HandleEnum(phost);
		if (status == USBH_OK) {
			/* The function shall return USBH_OK when full enumeration is complete */
			USBH_UsrLog("Enumeration done.");

			phost->device.current_interface = 0U;

			if (phost->device.DevDesc.bNumConfigurations == 1U) {
				USBH_UsrLog("This device has only 1 configuration.");
				phost->gState = HOST_SET_CONFIGURATION;
			} else {
				USBH_UsrLog("This device has more than 1 configuration, abort");
				phost->gState = HOST_ABORT_STATE; // only 1 configuration is supported
			}
#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		} else {
			if ((USBH_GetTick() - phost->Timeout) > USBH_DEV_RESET_TIMEOUT) {
				//USBH_UsrLog("USB Enumeration Failed, Please unplug the Device.");
				phost->gState = HOST_ABORT_STATE;
				phost->Timeout = USBH_GetTick(); //0;
				//} else {
				//phost->Timeout += 10U;
				//USBH_Delay(10U);
			}
		}
		break;

	case HOST_INPUT: {
		/* user callback for end of device basic enumeration */
		if (phost->pUser != NULL) {
			phost->pUser(phost, HOST_USER_SELECT_CONFIGURATION);
			phost->gState = HOST_SET_CONFIGURATION;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		}
	}
		break;

	case HOST_SET_CONFIGURATION:
		/* set configuration */
		if (USBH_SetCfg(phost,
				(uint16_t) phost->device.CfgDesc.bConfigurationValue)
				== USBH_OK) {
			phost->gState = HOST_SET_WAKEUP_FEATURE;
			USBH_UsrLog("Default configuration set.");
		} else {
			if ((USBH_GetTick() - phost->Timeout) > USBH_DEV_RESET_TIMEOUT) {
				//USBH_UsrLog("USB Configuration Failed, Please unplug the Device.");
				phost->gState = HOST_ABORT_STATE;
				phost->Timeout = USBH_GetTick(); //0;
			}
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

