rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC_GAMEPAD/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
	case HOST_SET_WAKEUP_FEATURE:

		if (((phost->device.CfgDesc.bmAttributes) & (1U << 5)) != 0U) {
			status = USBH_SetFeature(phost, FEATURE_SELECTOR_REMOTEWAKEUP);

			if (status == USBH_OK) {
				USBH_UsrLog("Device remote wakeup enabled");
				phost->gState = HOST_CHECK_CLASS;
			} else if (status == USBH_NOT_SUPPORTED) {
				USBH_UsrLog("Remote wakeup not supported by the device");
				phost->gState = HOST_CHECK_CLASS;
			} else {
				if ((USBH_GetTick() - phost->Timeout) > USBH_DEV_RESET_TIMEOUT) {
					//USBH_UsrLog("USB Configuration Failed, Please unplug the Device.");
					phost->gState = HOST_ABORT_STATE;
					phost->Timeout = USBH_GetTick(); //0;
				}
				/* .. */
			}
		} else {
			phost->gState = HOST_CHECK_CLASS;
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HOST_CHECK_CLASS:

		if (phost->ClassNumber == 0U) {
			USBH_UsrLog("No Class has been registered.");

			if ((USBH_GetTick() - phost->Timeout) > USBH_DEV_RESET_TIMEOUT) {
				//USBH_UsrLog("USB Configuration Failed, Please unplug the Device.");
				phost->gState = HOST_ABORT_STATE;
				phost->Timeout = USBH_GetTick(); //0;
			}
		} else {
			phost->pActiveClass = NULL;

			for (idx = 0U; idx < USBH_MAX_NUM_SUPPORTED_CLASS; idx++) {
				if (phost->pClass[idx]->ClassCode
						== phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass) {
					phost->pActiveClass = phost->pClass[idx];
					break;
				}
			}

			if (phost->pActiveClass != NULL) {
				if (phost->pActiveClass->Init(phost) == USBH_OK) {
					phost->gState = HOST_CLASS_REQUEST;
					USBH_UsrLog("%s class started.", phost->pActiveClass->Name);

					/* Inform user that a class has been activated */
					phost->pUser(phost, HOST_USER_CLASS_SELECTED);
				} else {
					phost->gState = HOST_ABORT_STATE;
					USBH_UsrLog("Device not supporting %s class.",
							phost->pActiveClass->Name);
				}
			} else {
				phost->gState = HOST_ABORT_STATE;
				USBH_UsrLog("No registered class for this device.");
			}
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HOST_CLASS_REQUEST:
		/* process class standard control requests state machine */
		if (phost->pActiveClass != NULL) {
			status = phost->pActiveClass->Requests(phost);

			if (status == USBH_OK) {
				phost->gState = HOST_CLASS;
			} else if (status == USBH_FAIL) {
				phost->gState = HOST_ABORT_STATE;
				//USBH_ErrLog("Device not responding Please Unplug.");
			} else {
				/* .. */
			}
		} else {
			phost->gState = HOST_ABORT_STATE;
			USBH_ErrLog("Invalid Class Driver.");
		}
#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HOST_CLASS:
		/* process class state machine */
		if (phost->pActiveClass != NULL) {
			phost->pActiveClass->BgndProcess(phost);
		}
		break;

	case HOST_DEV_DISCONNECTED:
		phost->device.is_disconnected = 0U;

		(void) DeInitStateMachine(phost);

		/* Re-Initilaize Host for new Enumeration */
		if (phost->pActiveClass != NULL) {
			phost->pActiveClass->DeInit(phost);
			phost->pActiveClass = NULL;
		}

		if (phost->pUser != NULL) {
			phost->pUser(phost, HOST_USER_DISCONNECTION);
		}
		USBH_UsrLog("USB Device disconnected");

		if (phost->device.is_ReEnumerated == 1U) {
			phost->device.is_ReEnumerated = 0U;

			/* Start the host and re-enable Vbus */
			(void) USBH_Start(phost);
		} else {
			/* Device Disconnection Completed, start USB Driver */
			(void) USBH_LL_Start(phost);
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HOST_ABORT_STATE:
		USBH_RecoveryPhost(phost);

		break;

	default:
		break;
	}
	return USBH_OK;
}

void USBH_RecoveryPhost(USBH_HandleTypeDef *phost) {
	USBH_UsrLog("Recovering USB module");

	USBH_HandleTypeDef phost_bkp;

	phost_bkp.id = phost->id;

	phost_bkp.pUser = phost->pUser;

	phost_bkp.ClassNumber = phost->ClassNumber;

	for (uint8_t i = 0; i < phost->ClassNumber; i++) {
		phost_bkp.pClass[i] = phost->pClass[i];
	}

	(void) USBH_Stop(phost);
	(void) USBH_DeInit(phost);

	(void) USBH_Init(phost, phost_bkp.pUser, phost_bkp.id);

	for (uint8_t i = 0; i < phost_bkp.ClassNumber; i++) {
		(void) USBH_RegisterClass(phost, phost_bkp.pClass[i]);
	}

	(void) USBH_Start(phost);
}

/**
 * @brief  USBH_HandleEnum
 *         This function includes the complete enumeration process
 * @param  phost: Host Handle
 * @retval USBH_Status
 */
static USBH_StatusTypeDef USBH_HandleEnum(USBH_HandleTypeDef *phost) {
	USBH_StatusTypeDef Status = USBH_BUSY;
	USBH_StatusTypeDef ReqStatus = USBH_BUSY;

	switch (phost->EnumState) {
	case ENUM_IDLE:
		//USBH_UsrLog("HandleEnum: ENUM_IDLE");
		/* Get Device Desc for only 1st 8 bytes : To get EP0 MaxPacketSize */
		ReqStatus = USBH_Get_DevDesc(phost, 8U);
		if (ReqStatus == USBH_OK) {
			phost->Control.pipe_size = phost->device.DevDesc.bMaxPacketSize;

			phost->EnumState = ENUM_GET_FULL_DEV_DESC;

			/* modify control channels configuration for MaxPacket size */
			(void) USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U,
					phost->device.address, phost->device.speed, USBH_EP_CONTROL,
					(uint16_t) phost->Control.pipe_size);

			/* Open Control pipes */
			(void) USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U,
					phost->device.address, phost->device.speed, USBH_EP_CONTROL,
					(uint16_t) phost->Control.pipe_size);
		} else if (ReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog("Control error: Get Device Descriptor request failed");
			phost->device.EnumCnt++;
			if (phost->device.EnumCnt > 3U) {
				/* Buggy Device can't complete get device desc request */
				USBH_UsrLog(
						"Control error, Device not Responding Please unplug the Device.");
				phost->gState = HOST_ABORT_STATE;
			} else {
				/* free control pipes */
				(void) USBH_FreePipe(phost, phost->Control.pipe_out);
				(void) USBH_FreePipe(phost, phost->Control.pipe_in);

				/* Reset the USB Device */
				phost->gState = HOST_IDLE;
			}
		} else {
			/* .. */
		}
		break;

