rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC_GAMEPAD/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
	case ENUM_GET_FULL_DEV_DESC:
		//USBH_UsrLog("HandleEnum: ENUM_GET_FULL_DEV_DESC");
		/* Get FULL Device Desc  */
		ReqStatus = USBH_Get_DevDesc(phost, USB_DEVICE_DESC_SIZE);
		if (ReqStatus == USBH_OK) {
			USBH_UsrLog("VID: %04Xh", phost->device.DevDesc.idVendor);
			USBH_UsrLog("PID: %04Xh", phost->device.DevDesc.idProduct);

			phost->EnumState = ENUM_SET_ADDR;
		} else if (ReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog(
					"Control error: Get Full Device Descriptor request failed");
			phost->device.EnumCnt++;
			if (phost->device.EnumCnt > 3U) {
				/* Buggy Device can't complete get device desc request */
				USBH_UsrLog(
						"Control error, Device not Responding Please unplug the Device.");
				phost->gState = HOST_ABORT_STATE;
			} else {
				/* Free control pipes */
				(void) USBH_FreePipe(phost, phost->Control.pipe_out);
				(void) USBH_FreePipe(phost, phost->Control.pipe_in);

				/* Reset the USB Device */
				phost->EnumState = ENUM_IDLE;
				phost->gState = HOST_IDLE;
			}
		} else {
			/* .. */
		}
		break;

	case ENUM_SET_ADDR:
		//USBH_UsrLog("HandleEnum: ENUM_SET_ADDR");
		/* set address */
		ReqStatus = USBH_SetAddress(phost, USBH_DEVICE_ADDRESS);
		if (ReqStatus == USBH_OK) {
			USBH_Delay(2U);
			phost->device.address = USBH_DEVICE_ADDRESS;

			/* user callback for device address assigned */
			USBH_UsrLog("Address (#%d) assigned.", phost->device.address);
			phost->EnumState = ENUM_GET_CFG_DESC;

			/* modify control channels to update device address */
			(void) USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U,
					phost->device.address, phost->device.speed, USBH_EP_CONTROL,
					(uint16_t) phost->Control.pipe_size);

			/* Open Control pipes */
			(void) USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U,
					phost->device.address, phost->device.speed, USBH_EP_CONTROL,
					(uint16_t) phost->Control.pipe_size);
		} else if (ReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog("Control error: Device Set Address request failed");

			/* Buggy Device can't complete get device desc request */
			USBH_UsrLog(
					"Control error, Device not Responding Please unplug the Device.");
			phost->gState = HOST_ABORT_STATE;
			phost->EnumState = ENUM_IDLE;
		} else {
			/* .. */
		}
		break;

	case ENUM_GET_CFG_DESC:
		//USBH_UsrLog("HandleEnum: ENUM_GET_CFG_DESC");
		/* get standard configuration descriptor */
		ReqStatus = USBH_Get_CfgDesc(phost, USB_CONFIGURATION_DESC_SIZE);
		if (ReqStatus == USBH_OK) {
			phost->EnumState = ENUM_GET_FULL_CFG_DESC;
		} else if (ReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog(
					"Control error: Get Device configuration descriptor request failed");
			phost->device.EnumCnt++;
			if (phost->device.EnumCnt > 3U) {
				/* Buggy Device can't complete get device desc request */
				USBH_UsrLog(
						"Control error, Device not Responding Please unplug the Device.");
				phost->gState = HOST_ABORT_STATE;
				Status = USBH_FAIL;
			} else {
				/* Free control pipes */
				(void) USBH_FreePipe(phost, phost->Control.pipe_out);
				(void) USBH_FreePipe(phost, phost->Control.pipe_in);

				/* Reset the USB Device */
				phost->EnumState = ENUM_IDLE;
				phost->gState = HOST_IDLE;
			}
		} else {
			/* .. */
		}
		break;

	case ENUM_GET_FULL_CFG_DESC:
		//USBH_UsrLog("HandleEnum: ENUM_GET_FULL_CFG_DESC");
		/* get FULL config descriptor (config, interface, endpoints) */
		ReqStatus = USBH_Get_CfgDesc(phost, phost->device.CfgDesc.wTotalLength);
		if (ReqStatus == USBH_OK) {
			phost->EnumState = ENUM_GET_MFC_STRING_DESC;
		} else if (ReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog(
					"Control error: Get Device configuration descriptor request failed");
			phost->device.EnumCnt++;
			if (phost->device.EnumCnt > 3U) {
				/* Buggy Device can't complete get device desc request */
				USBH_UsrLog(
						"Control error, Device not Responding Please unplug the Device.");
				phost->gState = HOST_ABORT_STATE;
			} else {
				/* Free control pipes */
				(void) USBH_FreePipe(phost, phost->Control.pipe_out);
				(void) USBH_FreePipe(phost, phost->Control.pipe_in);

				/* Reset the USB Device */
				phost->EnumState = ENUM_IDLE;
				phost->gState = HOST_IDLE;
			}
		} else {
			/* .. */
		}
		break;

	case ENUM_GET_MFC_STRING_DESC:
		//USBH_UsrLog("HandleEnum: ENUM_GET_MFC_STRING_DESC");
		if (phost->device.DevDesc.iManufacturer != 0U) {
			/* Check that Manufacturer String is available */
			ReqStatus = USBH_Get_StringDesc(phost,
					phost->device.DevDesc.iManufacturer, phost->device.Data,
					0xFFU);
			if (ReqStatus == USBH_OK) {
				/* User callback for Manufacturing string */
				USBH_UsrLog("Manufacturer : %s",
						(char* )(void* )phost->device.Data);
				phost->EnumState = ENUM_GET_PRODUCT_STRING_DESC;

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			} else if (ReqStatus == USBH_NOT_SUPPORTED) {
				USBH_UsrLog("Manufacturer : N/A");
				phost->EnumState = ENUM_GET_PRODUCT_STRING_DESC;

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			} else {
				/* .. */
			}
		} else {
			USBH_UsrLog("Manufacturer : N/A");
			phost->EnumState = ENUM_GET_PRODUCT_STRING_DESC;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		}
		break;

	case ENUM_GET_PRODUCT_STRING_DESC:
		//USBH_UsrLog("HandleEnum: ENUM_GET_PRODUCT_STRING_DESC");
		if (phost->device.DevDesc.iProduct != 0U) {
			/* Check that Product string is available */
			ReqStatus = USBH_Get_StringDesc(phost,
					phost->device.DevDesc.iProduct, phost->device.Data, 0xFFU);
			if (ReqStatus == USBH_OK) {
				/* User callback for Product string */
				USBH_UsrLog("Product : %s", (char* )(void* )phost->device.Data);
				phost->EnumState = ENUM_GET_SERIALNUM_STRING_DESC;
			} else if (ReqStatus == USBH_NOT_SUPPORTED) {
				USBH_UsrLog("Product : N/A");
				phost->EnumState = ENUM_GET_SERIALNUM_STRING_DESC;

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			} else {
				/* .. */
			}
		} else {
			USBH_UsrLog("Product : N/A");
			phost->EnumState = ENUM_GET_SERIALNUM_STRING_DESC;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		}
		break;

	case ENUM_GET_SERIALNUM_STRING_DESC:
		//USBH_UsrLog("HandleEnum: ENUM_GET_SERIALNUM_STRING_DESC");
		if (phost->device.DevDesc.iSerialNumber != 0U) {
			/* Check that Serial number string is available */
			ReqStatus = USBH_Get_StringDesc(phost,
					phost->device.DevDesc.iSerialNumber, phost->device.Data,
					0xFFU);
			if (ReqStatus == USBH_OK) {
				/* User callback for Serial number string */
				USBH_UsrLog("Serial Number : %s",
						(char* )(void* )phost->device.Data);
				Status = USBH_OK;
			} else if (ReqStatus == USBH_NOT_SUPPORTED) {
				USBH_UsrLog("Serial Number : N/A");
				Status = USBH_OK;
			} else {
				/* .. */
			}
		} else {
			USBH_UsrLog("Serial Number : N/A");
			Status = USBH_OK;
		}
		break;

	default:
		break;
	}
	return Status;
}

/**
 * @brief  USBH_LL_SetTimer
 *         Set the initial Host Timer tick
 * @param  phost: Host Handle
 * @retval None
 */
void USBH_LL_SetTimer(USBH_HandleTypeDef *phost, uint32_t time) {
	phost->Timer = time;
}

/**
 * @brief  USBH_LL_IncTimer
 *         Increment Host Timer tick
 * @param  phost: Host Handle
 * @retval None
 */
void USBH_LL_IncTimer(USBH_HandleTypeDef *phost) {
	phost->Timer++;
	USBH_HandleSof(phost);
}

/**
 * @brief  USBH_HandleSof
 *         Call SOF process
 * @param  phost: Host Handle
 * @retval None
 */
static void USBH_HandleSof(USBH_HandleTypeDef *phost) {
	if ((phost->gState == HOST_CLASS) && (phost->pActiveClass != NULL)) {
		phost->pActiveClass->SOFProcess(phost);
	}
}

/**
 * @brief  USBH_PortEnabled
 *         Port Enabled
 * @param  phost: Host Handle
 * @retval None
 */
void USBH_LL_PortEnabled(USBH_HandleTypeDef *phost) {
	phost->device.PortEnabled = 1U;

#if (USBH_USE_OS == 1U)
  phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

	return;
}

/**
 * @brief  USBH_LL_PortDisabled
 *         Port Disabled
 * @param  phost: Host Handle
 * @retval None
 */
void USBH_LL_PortDisabled(USBH_HandleTypeDef *phost) {
	phost->device.PortEnabled = 0U;

	return;
}

/**
 * @brief  HCD_IsPortEnabled
 *         Is Port Enabled
 * @param  phost: Host Handle
 * @retval None
 */
uint8_t USBH_IsPortEnabled(USBH_HandleTypeDef *phost) {
	return (phost->device.PortEnabled);
}

/**
 * @brief  USBH_LL_Connect
 *         Handle USB Host connexion event
 * @param  phost: Host Handle
 * @retval USBH_Status
 */
USBH_StatusTypeDef USBH_LL_Connect(USBH_HandleTypeDef *phost) {
	phost->device.is_connected = 1U;
	phost->device.is_disconnected = 0U;
	phost->device.is_ReEnumerated = 0U;

#if (USBH_USE_OS == 1U)
  phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

	return USBH_OK;
}

/**
 * @brief  USBH_LL_Disconnect
 *         Handle USB Host disconnection event
 * @param  phost: Host Handle
 * @retval USBH_Status
 */
USBH_StatusTypeDef USBH_LL_Disconnect(USBH_HandleTypeDef *phost) {
	/* update device connection states */
	phost->device.is_disconnected = 1U;
	phost->device.is_connected = 0U;
	phost->device.PortEnabled = 0U;

	/* Stop Host */
	(void) USBH_LL_Stop(phost);

	/* FRee Control Pipes */
	(void) USBH_FreePipe(phost, phost->Control.pipe_in);
	(void) USBH_FreePipe(phost, phost->Control.pipe_out);
#if (USBH_USE_OS == 1U)
  phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

	return USBH_OK;
}

#if (USBH_USE_OS == 1U)
/**
  * @brief  USB Host Thread task
  * @param  pvParameters not used
  * @retval None
  */

#if (osCMSIS < 0x20000U)
static void USBH_Process_OS(void const *argument)
{
  osEvent event;

  for (;;)
  {
    event = osMessageGet(((USBH_HandleTypeDef *)argument)->os_event, osWaitForever);
    if (event.status == osEventMessage)
    {
      USBH_Process((USBH_HandleTypeDef *)argument);
    }
  }
}
#else
static void USBH_Process_OS(void *argument)
{
  osStatus_t status;

  for (;;)
  {
    status = osMessageQueueGet(((USBH_HandleTypeDef *)argument)->os_event,
                               &((USBH_HandleTypeDef *)argument)->os_msg, NULL, osWaitForever);
    if (status == osOK)
    {
      USBH_Process((USBH_HandleTypeDef *)argument);
    }
  }
}
#endif /* (osCMSIS < 0x20000U) */


/**
  * @brief  USBH_LL_NotifyURBChange
  *         Notify URB state Change
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef  USBH_LL_NotifyURBChange(USBH_HandleTypeDef *phost)
{
  phost->os_msg = (uint32_t)USBH_PORT_EVENT;

#if (osCMSIS < 0x20000U)
  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif

  return USBH_OK;
}
#endif
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
